<?php

$arr[1] = rand(1,10);
$arr[2] = rand(1,10);
$arr[3] = rand(1,10);
$arr[4] = rand(1,10);
$arr[5] = rand(1,10);
$arr[6] = rand(1,10);
$arr[7] = rand(1,10);
$arr[8] = rand(1,10);
$arr[9] = rand(1,10);
$max = max($arr);
echo "Максимальное значение:". $max . "<br>";
$min = min($arr);
echo "Минимальное значение:". $min . "<br>";
echo "После изменений:". "<br>";
echo "Максимальное (минимальное) значение:". $min . "<br>";
echo "Минимальное (максимальное) значение:". $max . "<br>";


?>